In [62]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from sklearn.metrics import mean_squared_error
from collections import Counter

In [63]:
data_df = pd.read_excel('D:\\Study\\Downloads\\DataScience-Assignments\\Toyoto.xlsx',sheet_name='Sheet1')

In [64]:
data_df.head()

,Id,Model,Price,Age_08_04,Mfg_Month,Mfg_Year,KM,Fuel_Type,HP,Met_Color,...,Central_Lock,Powered_Windows,Power_Steering,Radio,Mistlamps,Sport_Model,Backseat_Divider,Metallic_Rim,Radio_cassette,Tow_Bar
0,1,TOYOTA Corolla 2.0 D4D HATCHB TERRA 2/3-Doors,13500,23,10,2002,46986,Diesel,90,1,...,1.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
1,2,TOYOTA Corolla 2.0 D4D HATCHB TERRA 2/3-Doors,13750,23,10,2002,72937,Diesel,90,1,...,1.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
2,3,TOYOTA Corolla 2.0 D4D HATCHB TERRA 2/3-Doors,13950,24,9,2002,41711,Diesel,90,1,...,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,4,TOYOTA Corolla 2.0 D4D HATCHB TERRA 2/3-Doors,14950,26,7,2002,48000,Diesel,90,0,...,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
4,5,TOYOTA Corolla 2.0 D4D HATCHB SOL 2/3-Doors,13750,30,3,2002,38500,Diesel,90,0,...,1.0,1.0,1.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0

In [65]:
data_df.columns

Index(['Id', 'Model', 'Price', 'Age_08_04', 'Mfg_Month', 'Mfg_Year', 'KM',
       'Fuel_Type', 'HP', 'Met_Color', 'Color', 'Automatic', 'cc', 'Doors',
       'Cylinders', 'Gears', 'Quarterly_Tax', 'Weight', 'Mfr_Guarantee',
       'BOVAG_Guarantee', 'Guarantee_Period', 'ABS', 'Airbag_1', 'Airbag_2',
       'Airco', 'Automatic_airco', 'Boardcomputer', 'CD_Player',
       'Central_Lock', 'Powered_Windows', 'Power_Steering', 'Radio',
       'Mistlamps', 'Sport_Model', 'Backseat_Divider', 'Metallic_Rim',
       'Radio_cassette', 'Tow_Bar'],
      dtype='object')

## Deleting most of the columns because in these columns around 4500 nan values are there. and also most of them are not useful.

In [67]:
data_df.drop(['Model','Id','Color','Automatic','Cylinders','Doors','Gears','Quarterly_Tax','Weight','Mfr_Guarantee','BOVAG_Guarantee','Guarantee_Period','ABS','Airbag_1', 'Airbag_2', 'Airco', 'Automatic_airco', 'Boardcomputer','CD_Player', 'Central_Lock', 'Powered_Windows', 'Power_Steering','Radio', 'Mistlamps', 'Sport_Model', 'Backseat_Divider', 'Metallic_Rim','Radio_cassette', 'Tow_Bar','cc'],axis=1,inplace=True)

In [68]:
data_df.isna().sum()

Price        0
Age_08_04    0
Mfg_Month    0
Mfg_Year     0
KM           0
Fuel_Type    0
HP           0
Met_Color    0
dtype: int64

In [69]:
# Check the stats of the data
data_df.describe()

              Price    Age_08_04    Mfg_Month     Mfg_Year    Met_Color
count   6259.000000  6259.000000  6259.000000  6259.000000  6259.000000
mean    2503.851254   368.270650     7.970922   470.073814   176.054162
std     4813.736131   290.085895     5.610944   834.675713   115.082275
min       25.000000     1.000000     1.000000    14.000000     0.000000
25%       33.000000   107.000000     4.000000    14.000000    51.000000
50%       66.000000   340.000000     8.000000    15.000000   205.000000
75%      100.000000   528.000000     8.000000    17.000000   273.000000
max    32500.000000  2100.000000    32.000000  2004.000000   339.000000

In [70]:
# Check if there is any null value in the dataset.
data_df.isna().sum()

Price        0
Age_08_04    0
Mfg_Month    0
Mfg_Year     0
KM           0
Fuel_Type    0
HP           0
Met_Color    0
dtype: int64

In [71]:
data_df.Fuel_Type.unique()

array(['Diesel', 'Petrol', 'CNG', 'no', 'yes'], dtype=object)

In [72]:
from sklearn import preprocessing 
label_encoder = preprocessing.LabelEncoder() 
data_df['Fuel_Type']= label_encoder.fit_transform(data_df['Fuel_Type'])

In [73]:
data_df.HP.unique()

array([90, 192, 69, 110, 97, 71, 116, 98, 86, 72, 107, 73, 'yes', 'no'],
      dtype=object)

In [74]:
data_df.drop(['HP','KM'],axis=1,inplace = True)

In [75]:
data_df.head()

   Price  Age_08_04  Mfg_Month  Mfg_Year  Fuel_Type  Met_Color
0  13500         23         10      2002          1          1
1  13750         23         10      2002          1          1
2  13950         24          9      2002          1          1
3  14950         26          7      2002          1          0
4  13750         30          3      2002          1          0

In [76]:
y = data_df.iloc[:,0]
X = data_df.iloc[:,1:]

In [77]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [78]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [79]:
regressor.fit(X_train, y_train)

LinearRegression()

In [80]:
y_pred = regressor.predict(X_test)

In [81]:
regressor.score(X_train,y_train)

0.8710421029455526

In [82]:
regressor.score(X_test,y_test)

0.868925477629855